// привет, мне нужно написать софт на golang с помощью которого можно будет выводить деньги с бирж, таких как okx, binance, bybit, bitget на свой тон кошелек
// также и наоборот, нужно чтобы этот софт самостоятельно закидывал определенные токены с кошелька тон на вышеупомянутые биржи
// нужна поддержка таких токенов, как ton, not, usdt, hmstr
// в папке src будут находиться все взаимодействия с биржами
// в txt файле будут храниться приватные ключи от кошельков Ton
// в config файле будут храниться настройки по выводу токенов, какие они, их кол-во с биржи на кошельки и с кошельков на биржи
// файл с телеграм ботом будет называться bot.go
// также я создал папку logs
// и также добавил .env файл где будут храниться данные бота